# Employee manager self join
http://www.postgresqltutorial.com/postgresql-self-join/

In [11]:
%load_ext sql

import numpy as np
import pandas as pd
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']
port = yaml_dict['port']

%sql postgres://postgres:$pw@localhost:$port/dvdrental

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@dvdrental'

# Create a database
![](../images/employee_manager1.png)

In [12]:
%sql drop table employee

 * postgres://postgres:***@localhost:5432/dvdrental
Done.

[]

In [13]:
%%sql

CREATE TABLE employee (
   employee_id INT PRIMARY KEY,
   first_name VARCHAR (255) NOT NULL,
   last_name VARCHAR (255) NOT NULL,
   manager_id INT,
   FOREIGN KEY (manager_id)
   REFERENCES employee (employee_id)
   ON DELETE CASCADE
);
INSERT INTO employee (
   employee_id,
   first_name,
   last_name,
   manager_id
)
VALUES
   (1, 'Windy', 'Hays', NULL),
   (2, 'Ava', 'Christensen', 1),
   (3, 'Hassan', 'Conner', 1),
   (4, 'Anna', 'Reeves', 2),
   (5, 'Sau', 'Norman', 2),
   (6, 'Kelsie', 'Hays', 3),
   (7, 'Tory', 'Goff', 3),
   (8, 'Salley', 'Lester', 3);

 * postgres://postgres:***@localhost:5432/dvdrental
Done.
8 rows affected.

[]

In [14]:
%%sql
select * from employee;

 * postgres://postgres:***@localhost:5432/dvdrental
8 rows affected.

[(1, 'Windy', 'Hays', None),
 (2, 'Ava', 'Christensen', 1),
 (3, 'Hassan', 'Conner', 1),
 (4, 'Anna', 'Reeves', 2),
 (5, 'Sau', 'Norman', 2),
 (6, 'Kelsie', 'Hays', 3),
 (7, 'Tory', 'Goff', 3),
 (8, 'Salley', 'Lester', 3)]

In [15]:
%%sql
SELECT
    e.first_name || ' ' || e.last_name employee,
    m .first_name || ' ' || m .last_name manager
FROM
    employee e
INNER JOIN employee m ON m .employee_id = e.manager_id
ORDER BY
    manager;

 * postgres://postgres:***@localhost:5432/dvdrental
7 rows affected.

[('Sau Norman', 'Ava Christensen'),
 ('Anna Reeves', 'Ava Christensen'),
 ('Salley Lester', 'Hassan Conner'),
 ('Kelsie Hays', 'Hassan Conner'),
 ('Tory Goff', 'Hassan Conner'),
 ('Ava Christensen', 'Windy Hays'),
 ('Hassan Conner', 'Windy Hays')]

In [16]:
%%sql
SELECT
    e.first_name || ' ' || e.last_name employee,
    m .first_name || ' ' || m .last_name manager
FROM
    employee e
LEFT JOIN employee m ON m .employee_id = e.manager_id
ORDER BY
    manager;

 * postgres://postgres:***@localhost:5432/dvdrental
8 rows affected.

[('Anna Reeves', 'Ava Christensen'),
 ('Sau Norman', 'Ava Christensen'),
 ('Salley Lester', 'Hassan Conner'),
 ('Kelsie Hays', 'Hassan Conner'),
 ('Tory Goff', 'Hassan Conner'),
 ('Hassan Conner', 'Windy Hays'),
 ('Ava Christensen', 'Windy Hays'),
 ('Windy Hays', None)]

# DVD Rental Database

In [17]:
%%sql
select * from film limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")]

In [18]:
# find films with same run time

In [19]:
%%sql
SELECT
    f1.title,
    f2.title,
    f1. length
FROM
    film f1
INNER JOIN film f2 ON f1.film_id <> f2.film_id
AND f1. length = f2. length
order by f1.title
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[('Academy Dinosaur', 'Annie Identity', 86),
 ('Academy Dinosaur', 'Gandhi Kwai', 86),
 ('Academy Dinosaur', 'Midnight Westward', 86),
 ('Academy Dinosaur', 'Yentl Idaho', 86),
 ('Ace Goldfinger', 'Heaven Freedom', 48)]

In [20]:
%%sql
SELECT
    distinct(f1.title),
    f2.title,
    f1. length
FROM
    film f1
INNER JOIN film f2 ON f1.film_id <> f2.film_id
AND f1. length = f2. length
order by f1.title
limit 5;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[('Academy Dinosaur', 'Midnight Westward', 86),
 ('Academy Dinosaur', 'Annie Identity', 86),
 ('Academy Dinosaur', 'Yentl Idaho', 86),
 ('Academy Dinosaur', 'Gandhi Kwai', 86),
 ('Ace Goldfinger', 'Valentine Vanishing', 48)]